{
    "projects": [
        {
            "title": "Trivia Party",
            "msg": [
                "The second game I worked with while company developing new project. This game also run on SnapChat supported multiplayer and matchmaking too. <p /> ",
                "I'm working closely with game designer to get some experiment features done and leant a lot how A/B experiment those feature in front of the player in Live enironment.<p />",
                "It help me learnt a lot about how the tech from the compnay and working closely and more work on platform SDK achieve difference feature using platform function"
            ],
            "vid": "LWYVdnVFHMw"
        },
        {
            "title": "Ready Chef Go",
            "msg": [
                "The game run on SnapChat supported multiplayer and matchmaking on backend, using Playcanvas (with TypeScript) for client and Nakama for Server. <p />",
                "I'm working on this project while onboarding to the new role, learning a lot of new tech out of my own deck such as : TypeScript, Golang, Playcanvas and Namaka, which is very exciting work closely to the team to get difference addon feature done <br /><br />",
                "*The video was captured with colleagues for marketing purpose"
            ],
            "vid": "rYHsOIh_Axg"
        },
        {
            "title": "Put To Rest",
            "msg": [
                "This is a mobile game using C++ game engine Cocos2dx, It is a big challenge to migrate a unfinish game project,",
                "and restructure and leading a team to review and redesign every of the details, but unfortunately it's can't stay until release that the startup company that running out of resources, but the game is almost publishable. <br /><br />", 
                "*the video is capture at the game directly"
            ],
            "vid": "pXyidbrz4B8"
        },
        {
            "title": "God Legion",
            "msg": [
                "This is a mobile game using obj-c game engine Cocos2d-iphone. It's a first mobile game that I made.<br />",
                "Work with a small team that R&D what we need to do and how, from design (study the idea from another game BattleHeart I love to play), ",
                "to develop what the language is new, and everything from group to build up with content structure, animation, gameplay, to supporting tool for artist.<br /><br />", 
                "To be honestly, It's is comic IP in HK that help a lot we can get the Top3 at HK game appstore at that moment, and learn much on it."
            ],
            "vid": "lkZtfVtnYe0"
        },
        {
            "title": "Little Fighter Online",
            "msg": [
                "Beginning of my game dev career, A online game by using C++ with dx, that I learn much on the content control and game engine relation with core game play link to small pieces, like characters, animation, action, story telling, sound FX...etc.<br /><br />", 
                "My main purpose to create content for the game to develop some new system for it, also making useful content supporting tools (VB) what I learn from school to edit every type of content file easier and do the validation.<br /><br />",
                "Also study a little on the server side architecture, at DB, python, socket. <br /><br />", 
                "*this is a fans video for backup and referencethere have another game concept use the same core engine to dev a new game with new feature W3K"
            ],
            "vid": "QQr1bBCstYg"
        },
        {
            "title": "War Three Kingdom",
            "msg": [
                "This is an other game using c++ & dx, develop from the base like LFO the early title from the same company, with another topic and develop improved system.<br /><br />", 
                "More space at Up&Down, fighting system with combo customize, resource digging, and more like MMORPG with crafting system."
            ],
            "vid": "4mvLd6SNFpI"
        },
        {
            "title": "I.O.",
            "msg": [
                "This is a VR Game for MSI VR Game Jam end of 2016 event that I work with my wife spend around.<br /><br />", 
                "That just a simple VR game with touching item and play it in sequence to get to the Goal like a Room Escape, kindly that I don't have much 3D game experience so tried to take this challange with Unity "
            ],
            "vid": "NGNaxZBIT0E"
        },
        {
            "title": "0214",
            "msg": [
                "This is a Global Game Jam 2020 project<br /><br />", 
                "Using the Unity have a try again, but just a concept that would using the 'Love' topic to play around many of minigames to survive the relationship <br /> ",
                "Submittion link : <a href='https://globalgamejam.org/2020/games/0214-1' target='_blank'>Global Game Jam 2020</a> "
            ],
            "vid": "j9vATdn8_NU"
        }
    ]
}