{
    "projects": [
        {
            "title": "Trivia Party",
            "msg": [
                "The second game I worked on was a multiplayer matchmaking game developed for Snapchat. <p /> ",
                "I was working closely with game designers to implement experimental features and learn how to A/B test them in the live environment. <br />",
                "This has helped me learn a lot about the company's technology and how to use platform SDKs to achieve different features using platform functions.",
                "<p/><i>Tech : TypeScript, playcanvas, golang, Nakama</i>"
            ],
            "vid": "LWYVdnVFHMw"
        },
        {
            "title": "Ready Chef Go",
            "msg": [
                "The game runs on Snapchat with multiplayer and matchmaking support on the backend, using Playcanvas (with TypeScript) for the client and Nakama (with Golang) for the server. <p />",
                "I was working on this project while onboarding to the new role. I am learning a lot of new technologies that were outside of my comfort zone, such as TypeScript, Golang, Playcanvas, and Nakama.<br />",
                "It is very exciting to work closely with the team to develop different add-on features.<p />",
                "*The video was captured with colleagues for marketing purpose",
                "<p/><i>Tech : TypeScript, playcanvas, golang, Nakama</i>"
            ],
            "vid": "rYHsOIh_Axg"
        },
        {
            "title": "Put To Rest",
            "msg": [
                "This is a mobile game developed using C++ game engine Cocos2dx, It was a big challenge to migrate an unfinish game project,",
                "restructure it and lead a team to review and redesign every detail.  Unfortunately, the startup company ran out of resources before the game could be released, even though it was almost publishable. <br /><br />", 
                "*the video is capture at the game directly",
                "<p/><i>Tech : c++, Cocos2d-x</i>"
            ],
            "vid": "pXyidbrz4B8"
        },
        {
            "title": "God Legion",
            "msg": [
                "This is the first mobile game I made, using the Objective-C game engine Cocos2d-iphone.<br />",
                "I worked with a small team to research and develop all aspects of the game, from design (inspired by the game BattleHeart, which I love to play) to development (in a new language) to content structure, animation, gameplay, and artist support tools.<br /><br />", 
                "The game was based on a popular comic IP in Hong Kong, which helped us to achieve a top 3 ranking on the Hong Kong App Store at the time. I learned a lot from this project.",
                "<p/><i>Tech : objective-c, Cocos2d-iphone</i>"
            ],
            "vid": "lkZtfVtnYe0"
        },
        {
            "title": "Crayon Shin-chan VR",
            "msg": [
                "A short free-roaming VR experience for up to 4 players, used for a popup campaign in a Hong Kong mall. <br />",
                "I was invited to work on this freelance project by a friend who was handling the networking. I was responsible for all client-side logic, including game design and operation flow for frontline staff.<br />",
                "The project was challenging due to the limited time and budget, but it was a valuable learning experience.",
                "<p/><i>Tech : c#, Unity3D</i>"
            ],
            "vid": "3XC7oQh4FO4"
        },
        {
            "title": "Little Fighter Online",
            "msg": [
                "At the beginning of my game development career, I worked on an online game developed using C++ and DirectX. This project taught me a lot about content control, the relationship between game engines and core gameplay, and how to break down gameplay into smaller pieces, such as characters, animation, action, storytelling, and sound effects.<br /><br />", 
                "My main responsibility on this project was to create content for the game and develop new systems. I also created useful content support tools using VB (something I learned in school) to make it easier to edit and validate all types of content files.<br /><br />",
                "I also learned a little about server-side architecture, including databases, Python, and sockets. <br /><br />", 
                "*this is a fans video for backup and reference there have another game concept use the same core engine to dev a new game with new feature W3K",
                "<p/><i>Tech : c++, VB, VC6</i>"
            ],
            "vid": "QQr1bBCstYg"
        },
        {
            "title": "War Three Kingdom",
            "msg": [
                "This is another game developed using C++ and DirectX, based on the same company's earlier title, LFO, but with a different theme and improved systems. <br /><br />", 
                " It has more space for exploration, a customizable combo system, resource digging, and other MMORPG-like features, such as a crafting system.",
                "<p/><i>Tech : c++, VB, VC6</i>"
            ],
            "vid": "4mvLd6SNFpI"
        },
        {
            "title": "I.O.",
            "msg": [
                "This is a VR game that I made with my wife for the MSI VR Game Jam in late 2016. <br /><br />", 
                " It's a simple room escape game where you touch items and play them in a sequence to reach the goal. I didn't have much 3D game experience at the time, but I wanted to take on the challenge of using Unity to make a VR game.",
                "<p/><i>Tech : c#, Unity3D</i>"
            ],
            "vid": "NGNaxZBIT0E"
        },
        {
            "title": "0214",
            "msg": [
                "This is a Global Game Jam 2020 project<br /><br />", 
                "Using Unity again, I tried to create a concept game based on the theme of love. The game would involve playing a variety of minigames to survive the relationship. <br /> ",
                "Submittion link : <a href='https://globalgamejam.org/2020/games/0214-1' target='_blank'>Global Game Jam 2020</a> ",
                "<p/><i>Tech : c#, Unity3D</i>"
            ],
            "vid": "j9vATdn8_NU"
        },
        {
            "title": "Learning Unreal part.1 (Blueprint)",
            "msg": [
                "This is a learning project from <a href='https://www.gamedev.tv/p/unreal-5-0-c-developer-learn-c-and-make-video-games/?coupon_code=BLIMEY' target='_blank'>gamedev.tv course</a><br /><br />", 
                "The course teaches how to use Unreal Engine with C++, but it starts with an introduction to Blueprint development.<br/>",
                "I learned Unreal Engine 5.3.0 from scratch and gained a basic understanding of how it works. I also studied online to learn about UI development. <br /> ",
                "<br />Here are some of the topics I learned:<ul><li>Actor-related logics with Blueprint</li>",
                "<li>Basic physics engine settings</li>",
                "<li>Geometry Brushes</li>",
                "<li>Input interaction and actor (Blueprint class) creation</li>",
                "<li>Blueprint class structure with functions and variables</li>",
                "<li>Some UI runtime updates and delays</li>",
                "</ul>",
                "<br/><a href='https://kiwispace.net/BP_winExec.zip' target='_blank'>Windown ver. zip</a><br />"
            ],
            "vid": "nScorEeq52c"
        },
        {
            "title": "Learning Unreal part.2 (c++)",
            "msg": [
                "This is another project continus on the <a href='https://www.gamedev.tv/p/unreal-5-0-c-developer-learn-c-and-make-video-games/?coupon_code=BLIMEY' target='_blank'>gamedev.tv course</a> learning Unreal using c++ <br /><br />", 
                "Using the assets suggested by the course and learnt a lot about the basic concept from project setup to game play logics<br/>",
                "<br />Here are some of the points I learned:<ul><li>How c++ work with VSCode and complier code refreshing Unreal Engine</li>",
                "<li>VSCode extension help on c++ & Unreal development</li>",
                "<li>Functions from Unreal Libs doing the same / similar job as Blueprint</li>",
                "<li>C++ Class & Blueprint Class & Animation Class... etc</li>",
                "<li>Live code editing + debugger using VSCode </li>",
                "</ul><br />There have some broken cause cannot build it up to EXE, will see how to fix it as another lesson (Proper some asset from 4.x to 5.3 issues)"
            ],
            "vid": "fZ7IKuNrKXs"
        },
        {
            "title": "game",
            "type": "game"
        }
    ]
}